constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 0) //0
	(1 0 0) //1
	(1 0.1 0) //2
	(0 0.1 0) //3
	(0 0 0.1) //4
	(1 0 0.1) //5
	(1 0.1 0.1) //6
	(0 0.1 0.1) //7
	(2 0 0) //8
	(2 0.1 0) //9
	(2 0 0.1) //10
	(2 0.1 0.1) //11
	(2 -0.1 0) //12
	(1 -0.1 0) //13
	(2 -0.1 0.1) //14
	(1 -0.1 0.1) //15
	
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (200 20 1) simpleGrading (1 1 1)
    hex (13 12 8 1 15 14 10 5) (200 20 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
	type patch;
	faces
	(
	    (0 4 7 3)
	);
    }
    
    outlet
    {
	type patch;
	faces
	(
		(8 10 11 9)
		(12 14 10 8)
	);
    }

    fixedWalls
    {
        type wall;
        faces
        (
		(6 7 3 2)
		(5 1 0 4)
		(11 6 2 9)
		(14 12 13 15)
		(13 1 5 15)
        );
    }
    
/*    lowerWalls
    {
	type wall;
	faces
	(
            (3 2 10 11)

	)
    }
*/
    frontAndBack
    {
        type empty;
        faces
        (
		(6 5 4 7)
		(2 3 0 1)
		(11 10 5 6)
		(10 14 15 5)
		(9 2 1 8)
		(8 1 13 12)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
